# Convert Raw data to Clean data

In [3]:
import pandas as pd

In [5]:
raw_data = pd.read_excel(r'C:\Users\Admin\Downloads\rawdata to cleandata\TASK -- convert raw data - clean data.xlsx')
raw_data

                                           ADDR         DT NAME     time
0  45 rd, kenith street, btm, bangalore, 500038 2022-04-03  abc  8:30:21
1            45 rd,  street, hitech, Hd, 500038 2022-04-02  dec  5:30:21

In [7]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ADDR    2 non-null      object
 1   DT      2 non-null      datetime64[ns]
 2   NAME    2 non-null      object
 3   time    2 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 196.0+ bytes

In [9]:
raw_data.columns

Index(['ADDR', 'DT', 'NAME', 'time'], dtype='object')

In [13]:
raw_data[['ROAD', 'STREET', 'AREA', 'CITY', 'ZIP']] = raw_data['ADDR'].str.split(',', expand = True)

In [15]:
raw_data

,ADDR,DT,NAME,time,ROAD,STREET,AREA,CITY,ZIP
0,"45 rd, kenith street, btm, bangalore, 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038
1,"45 rd, street, hitech, Hd, 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038

In [17]:
raw_data['Day'] = raw_data['DT'].dt.day
raw_data['Month'] = raw_data['DT'].dt.month
raw_data['Year'] = raw_data['DT'].dt.year

In [21]:
raw_data[['Hours', 'Minutes', 'Seconds']] = raw_data['time'].str.split(':', expand = True)

In [23]:
raw_data

,ADDR,DT,NAME,time,ROAD,STREET,AREA,CITY,ZIP,Day,Month,Year,Hours,Minutes,Seconds
0,"45 rd, kenith street, btm, bangalore, 500038",2022-04-03,abc,8:30:21,45 rd,kenith street,btm,bangalore,500038,3,4,2022,8,30,21
1,"45 rd, street, hitech, Hd, 500038",2022-04-02,dec,5:30:21,45 rd,street,hitech,Hd,500038,2,4,2022,5,30,21

In [27]:
raw_data.drop(['ADDR', 'DT', 'time'] ,axis = 1,inplace = True)

In [29]:
Clean_data = raw_data
Clean_data

,NAME,ROAD,STREET,AREA,CITY,ZIP,Day,Month,Year,Hours,Minutes,Seconds
0,abc,45 rd,kenith street,btm,bangalore,500038,3,4,2022,8,30,21
1,dec,45 rd,street,hitech,Hd,500038,2,4,2022,5,30,21

In [31]:
raw_data.to_excel(r'C:\Users\Admin\Downloads\rawdata to cleandata\TASK -- convert raw data - clean data.xlsx', index = False)

In [33]:
Clean_data

,NAME,ROAD,STREET,AREA,CITY,ZIP,Day,Month,Year,Hours,Minutes,Seconds
0,abc,45 rd,kenith street,btm,bangalore,500038,3,4,2022,8,30,21
1,dec,45 rd,street,hitech,Hd,500038,2,4,2022,5,30,21